Tekla Open API Reference for Tekla Structures 2025
RebarSpacingZone.LengthType Property
 Gets or sets a value indicating whether the length is absolute or relative. If the length is relative the length property is treated as a proportion of the overall available spacing length (from the associated RebarGuideline). The available spacing length is the guideline length less the calculated start and end offsets and less any fixed length spacing zones. An example of how relative length values are handled: With two relative length zones with proposed length values of 10 and 20 respectively the final calculated lengths will normally be 'available spacing length'*10/(10+20) and 'available spacing length'*20/(10+20) though the spacing algorithm may determine a different result in some situations.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarSpacingZone.LengthEnum LengthType { get; set; }
Public Property LengthType As RebarSpacingZone.LengthEnum
	Get
	Set
Property Value
Type: RebarSpacingZone.LengthEnum
See Also
Reference
RebarSpacingZone Class
Tekla.Structures.Model Namespace